src/cfe/ИнтеграцияСRabbitMQ/InformationRegisters/RMQ_НастройкиПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>RMQ_НастройкиПодключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_ВиртуальныеХосты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/ИнтеграцияСRabbitMQ/InformationRegisters/RMQ_НастройкиПодключения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДействуетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДействуетПриИзмененииНаСервере()
	Элементы.ВиртуальныйХост.ТолькоПросмотр = НЕ Запись.Действует;
	Элементы.Адрес.ТолькоПросмотр = НЕ Запись.Действует;
	Элементы.Порт.ТолькоПросмотр = НЕ Запись.Действует;
	Элементы.ИмяПользователя.ТолькоПросмотр = НЕ Запись.Действует;
	Элементы.Пароль.ТолькоПросмотр = НЕ Запись.Действует;
КонецПроцедуры

&НаКлиенте
Процедура ДействуетПриИзменении(Элемент)
	ДействуетПриИзмененииНаСервере();
КонецПроцедуры
